In [1]:
#US - Baby Names

In [2]:
#Step 1. Import the necessary libraries

import pandas as pd

In [3]:
pwd()

'C:\\Users\\india'

In [4]:
#Step 2. Import the dataset

df=pd.read_csv('US_Baby_Names_right.csv')

In [5]:
df

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

In [6]:
#Step 3. Assign it to a variable called baby_names.

baby_names = df

In [7]:
baby_names

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

In [8]:
#Step 4. See the first 10 entries

baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

In [9]:
#Step 5. Delete the column 'Unnamed: 0' and 'Id'

del baby_names['Id']
del baby_names['Unnamed: 0']

In [10]:
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

In [22]:
#Step 6. Is there more male or female names in the dataset?

baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

In [12]:
baby_names.groupby('Gender').agg({'Count': 'sum'})

           Count
Gender
F       16380293
M       19041199

In [23]:
#Step 7. Group the dataset by name and assign to names

# you don't want to sum the Year column, so you delete it
del baby_names["Year"]

# group the data
names = baby_names.groupby("Name").sum()

# print the first 5 observations
names.head()

# print the size of the dataset
print(names.shape)

# sort it from the biggest value to the smallest one
names.sort_values("Count", ascending = 0).head()

(17632, 1)

           Count
Name
Jacob     242874
Emma      214852
Michael   214405
Ethan     209277
Isabella  204798

In [14]:
#Step 8. How many different names exist in the dataset?
# as we have already grouped by the name, all the names are unique already. 
# get the length of names

baby_names.Name.nunique()

17632

In [15]:
len(names)

17632

In [24]:
#Step 9. What is the name with most occurrences?

names.Count.idxmax()

'Jacob'

In [25]:
#Step 10. How many different names have the least occurrences?

len(names[names.Count == names.Count.min()])

2578

In [26]:
names.Count

Name
Aaban        12
Aadan        23
Aadarsh       5
Aaden      3426
Aadhav        6
           ...
Zyra         42
Zyrah        11
Zyren         6
Zyria        59
Zyriah       58
Name: Count, Length: 17632, dtype: int64

In [27]:
names.Count.min()

5

In [18]:
#Step 11. What is the median name occurrence?

names.Count.sum().median()

49.0

In [19]:
#Step 12. What is the standard deviation of names?

names.Count.sum().std()

11006.06946789057

In [20]:
#Step 13. Get a summary with the mean, min, max, std and quartiles.

In [21]:
names.Count.sum().mean()
names.Count.sum().min()
names.Count.sum().max()
names.Count.sum().std()
names.Count.sum().describe()

count     17632.000000
mean       2008.932169
std       11006.069468
min           5.000000
25%          11.000000
50%          49.000000
75%         337.000000
max      242874.000000
Name: Count, dtype: float64